#include <stdio.h>

int main()//计算英式长度单位化为米
{
    int foot, inch;
    // 可以直接定义浮点数，这里的double意为双精度浮点数（区别于float单精度
    double f;

    printf("输入几尺几寸，例如\"5 7\"表示5英尺7英寸（一米七）：");
    scanf("%d %d", &foot,  &inch);

    //返回这样运算的结果只和foot相关
    //因为 inch/12的两个整数运算的结果是一个整数（截断小数部分，也就是0
    printf("换算为%f米。\n", 
            ((foot+inch/12)*0.3048));
    
    //整数运算
    printf("一些运算结果：\n10/3=%d\n5/2=%d\n", 10/3, 5/2);

    //解决方案,浮点数和整数混合运算得到整数
    //浮点数区别于定点数，前者小数点可变位置后者不可以
    printf("10.0/3=%f\n", 10.0/3);

    //获取浮点数输入的时候需要用 %lf
    printf("输入一个浮点数：");
    //即使输入的是整数也会识别为浮点
    scanf("%lf", &f);
    printf("%f\n", f);

    return 0;
}